# language: ru
Функция: Яндекс Маркет Таск 2

  Сценарий: Яндекс Маркет Заполнение формы
    Дано открыта страница "https://yandex.ru/"
    Тогда нажать на "Маркет"
	И нажать на "Электроника"
	И нажать на "Наушники"

	Если заполнить в секции "Цена" поле:
    | Цена            | 5000   |
    И выбрать в секции "Производитель" чек-боксы:
	| Beats     |
    И нажать на "Применить"

	Тогда проверить что элементов на странице "12"
	Если у первого элемента в списке запомнить "МОДЕЛЬ"

	Тогда заполнить в секции "Поиск" поле:
    | Поиск           | МОДЕЛЬ |
	И нажать на "Найти"
	И проверить что список содержит "МОДЕЛЬ"